#### Pandas
- Panel Datas 약자
- 다양한 파일 형식 지원 가능
- 데이터 정제 및 조작 특화 라이브러리
- DataFrame, Series, ndarray 기반으로 구성
    - numpy와 함께 사용하면 효율이 극대화
    - Numpy : 다차원 배열 처리, 요소별 연산 특화
    - Pandas : 표 형태의 데이터 처리 특화

- Series : pandas에서 제공되는 자료형 중에 하나
- DataFrame : pandas에서 제공되는 자료형 중에 하나
    - 2차원 배열 형태의 자료형
    - columns, row 구조
    - Series들의 모임 == DataFrame > 컴퓨터한테느 행이라는 개념이 어려움

In [10]:
import numpy as np
import pandas as pd

In [28]:
pop = pd.Series([9904312,3448737,2890451,2466052],
                index= ['서울','부산','인천','대구'])
pop

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [29]:
print("Series의 값 확인:",pop.values)
print("Series 인덱스 확인:",pop.index)
print("Series 데이터 타비 확인:",pop.dtype)

Series의 값 확인: [9904312 3448737 2890451 2466052]
Series 인덱스 확인: Index(['서울', '부산', '인천', '대구'], dtype='object')
Series 데이터 타비 확인: int64

In [30]:
pop.name = '인구'
display(pop)

pop.index.name = '지역'
display(pop)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

지역
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [31]:
pop / 100000

지역
서울    99.04312
부산    34.48737
인천    28.90451
대구    24.66052
Name: 인구, dtype: float64

#### 다중 Boolean 인덱싱
- 250만 이상이면서, 500만 이하

In [32]:
# 250만 이상이면서, 500만 이하
[(pop >= 2500000) & (pop <= 5000000)]

[지역
 서울    False
 부산     True
 인천     True
 대구    False
 Name: 인구, dtype: bool]

In [33]:
# 슬라이싱
pop[1:4]
pop["부산":"대구"]

지역
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [34]:
data = {
    "서울":9904312,
    "부산":3448737,
    "인천":2890451,
    "대구":2466052
} 
data

{'서울': 9904312, '부산': 3448737, '인천': 2890451, '대구': 2466052}

#### 데이터프레임 생성
- ndarray : 다차원
-

In [38]:
# 딕셔너리 형으로 DataFrame 생성
data = {"2015":[9904312,3448737,2890451,2466052],
        "2010":[9631482,3393191,2632035,2431774]}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [963148, 3393191, 2632035, 2431774]}

In [40]:
df = pd.DataFrame(data)
df

      2015     2010
0  9904312   963148
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [43]:
df.index = ['서울','부산','인천','대구']

In [44]:
df

       2015     2010
서울  9904312   963148
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [49]:
# list로 DataFrame 생성 > row별 추가
list1 = [[9904312,3448737,2890451,2466052],[9631482,3393191,2632035,2431774]]

col = ["서울","부산","인천","대구"]
idx = ["2015","2010"]
df2 = pd.DataFrame(list1, index=idx,columns=col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [53]:
# 전치
df2 = df2.T
df2

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [91]:
a = [[0, 4, 2],[0, 3, 2],[0, 2, 2]]
b = [0, 1, 2, 4, 3]
answer = []
list1 = []
for i in a:
    x,y,z = i
    print(x,y,z)
    a = [j for j in b[x:y+1] if j > 2]
    if len(a) != 0:
        answer.append(min(a))
    else:
        answer.append(-1)
    

print(answer)

0 4 2
0 3 2
0 2 2
[3, 4, -1]

In [94]:
a = [[0, 4, 2],[0, 3, 2],[0, 2, 2]]
b = [0, 1, 2, 4, 3]

[0, 1, 2, 4, 3, 0, 0, 0, 0, 0]

In [147]:
a = [[0, 4, 2],[0, 3, 2],[0, 2, 2]]
b = [0, 1, 2, 4, 3]

answer = []
for i in a:
    x,y,z = i
    check = b[x:y+1]
    end = b[y+1:]
    k = [1,2,3,4]

[0, 1, 2, 4, 3]
[]
[0, 1, 2, 4]
[3]
[0, 1, 2]
[4, 3]